In [5]:
!pip install pymysql
!pip install SQLAchemy

Collecting pymysql
  Obtaining dependency information for pymysql from https://files.pythonhosted.org/packages/e5/30/20467e39523d0cfc2b6227902d3687a16364307260c75e6a1cb4422b0c62/PyMySQL-1.1.0-py3-none-any.whl.metadata
  Downloading PyMySQL-1.1.0-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
   ---------------------------------------- 0.0/44.8 kB ? eta -:--:--
   --------------------------- ------------ 30.7/44.8 kB 435.7 kB/s eta 0:00:01
   ------------------------------------ --- 41.0/44.8 kB 393.8 kB/s eta 0:00:01
   ---------------------------------------- 44.8/44.8 kB 313.9 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

ERROR: Could not find a version that satisfies the requirement SQLAchemy (from versions: none)
ERROR: No matching distribution found for SQLAchemy

In [7]:
import pymysql 
import pandas as pd

In [8]:
conn = pymysql.connect(host="localhost",port=int(3306),user= "root",passwd = "Malik@1998",db= "b89")
print("Connection Established",conn)

Connection Established <pymysql.connections.Connection object at 0x000001B9C32D6DD0>

In [9]:
df = pd.read_sql_query("SELECT * From employee",conn)
df

C:\Users\MD SUHAIL MALIK\AppData\Local\Temp\ipykernel_16220\1589687895.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT * From employee",conn)

        Role        Name Building  Years_employed
0   Engineer    Becky A.       1e               4
1   Engineer      Dan B.       1e               2
2   Engineer   Sharon F.       1e               6
3   Engineer      Dan M.       1e               4
4   Engineer   Malcom S.       1e               1
5     Artist    Tylar S.       2w               2
6     Artist  Sherman D.       2w               8
7     Artist    Jakob J.       2w               6
8     Artist   Lillia A.       2w               7
9     Artist  Brandon J.       2w               7
10   Manager    Scott K.       1e               9
11   Manager  Shirlee M.       1e               3
12   Manager    Daria O.       2w               6